In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('Dataset_proj1.csv')

In [3]:
data.head()

   Unnamed: 0        Date             Time  Customer_ID           Item
0           0  2017-01-02  01:47:28.279733     55853434   Palak Paneer
1           1  2017-01-08  13:12:29.726141     29718647     Palak Aloo
2           2  2017-01-11  14:06:23.304466     18142412           Roti
3           3  2017-01-17  00:29:55.890029     34176848      Dal Tadka
4           4  2017-01-17  06:12:39.712888     49263612  Shabnam Curry

In [4]:
data.columns

Index(['Unnamed: 0', 'Date', 'Time', 'Customer_ID', 'Item'], dtype='object')

In [5]:
data.drop('Unnamed: 0',axis = 1, inplace=True)

In [6]:
data.head()

         Date             Time  Customer_ID           Item
0  2017-01-02  01:47:28.279733     55853434   Palak Paneer
1  2017-01-08  13:12:29.726141     29718647     Palak Aloo
2  2017-01-11  14:06:23.304466     18142412           Roti
3  2017-01-17  00:29:55.890029     34176848      Dal Tadka
4  2017-01-17  06:12:39.712888     49263612  Shabnam Curry

In [7]:
data['Date'] = pd.to_datetime(data['Date'])

In [8]:
data.head()

        Date             Time  Customer_ID           Item
0 2017-01-02  01:47:28.279733     55853434   Palak Paneer
1 2017-01-08  13:12:29.726141     29718647     Palak Aloo
2 2017-01-11  14:06:23.304466     18142412           Roti
3 2017-01-17  00:29:55.890029     34176848      Dal Tadka
4 2017-01-17  06:12:39.712888     49263612  Shabnam Curry

In [9]:
data.shape

(500, 4)

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         500 non-null    datetime64[ns]
 1   Time         500 non-null    object
 2   Customer_ID  500 non-null    int64
 3   Item         500 non-null    object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 15.8+ KB

In [11]:
data['Time'] = pd.to_datetime(data['Time'])

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         500 non-null    datetime64[ns]
 1   Time         500 non-null    datetime64[ns]
 2   Customer_ID  500 non-null    int64
 3   Item         500 non-null    object
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 15.8+ KB

In [13]:
data.head()

        Date                       Time  Customer_ID           Item
0 2017-01-02 2021-07-11 01:47:28.279733     55853434   Palak Paneer
1 2017-01-08 2021-07-11 13:12:29.726141     29718647     Palak Aloo
2 2017-01-11 2021-07-11 14:06:23.304466     18142412           Roti
3 2017-01-17 2021-07-11 00:29:55.890029     34176848      Dal Tadka
4 2017-01-17 2021-07-11 06:12:39.712888     49263612  Shabnam Curry

In [14]:
data.Item.unique()

array(['Palak Paneer', 'Palak Aloo', 'Roti', 'Dal Tadka', 'Shabnam Curry',
       'Garlic Naan', 'Naan', 'Chana Paneer', 'Achari Paneer',
       'Aloo Gobi', 'Paneer Makhani', 'Paneer Butter Masala',
       'Dal Makhani', 'Chana Masala', 'Vegetable Green Masala',
       'Bhindi Masala', 'Malai Kofta', 'Paneer Shahi Korma', 'Aloo Matar',
       'Matar Paneer', 'Paratha', 'Mixed Vegetable Curry',
       'Baigan Bharta', 'Navratan Korma', 'Mixed Vegetable Vindaloo'],
      dtype=object)

In [ ]:
Items = {'Palak Paneer', 'Palak Aloo', 'Roti', 'Dal Tadka', 'Shabnam Curry',
       'Garlic Naan', 'Naan', 'Chana Paneer', 'Achari Paneer',
       'Aloo Gobi', 'Paneer Makhani', 'Paneer Butter Masala',
       'Dal Makhani', 'Chana Masala', 'Vegetable Green Masala',
       'Bhindi Masala', 'Malai Kofta', 'Paneer Shahi Korma', 'Aloo Matar',
       'Matar Paneer', 'Paratha', 'Mixed Vegetable Curry',
       'Baigan Bharta', 'Navratan Korma', 'Mixed Vegetable Vindaloo'}